package ru.timus.acm;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

/*
Студент Петя решил открыть свой бизнес — он предлагает арендаторам офисов в только что открывшемся небоскрёбе Призма услуги SMS-рекламы.
Услуга заключается в том, что заказчик придумывает речёвку про свою фирму,
а Петя со своего сотового телефона рассылает ее как SMS-сообщение тысячам жителей Екатеринбурга, используя купленную у пиратов базу телефонных номеров горожан.
Стоимость каждой речёвки определяется как сумма стоимостей каждого символа в ней,
а стоимость символов Петя определяет по незатейливой схеме: за каждое свое нажатие на кнопку телефона он берёт по 1 рублю.
Петин телефон не поддерживает T9 и имеет только английскую раскладку:
1
abc	2
def	3
ghi
4
jkl	5
mno	6
pqr
7
stu	8
vwx	9
yz
 	0
.,!	#
_
Символом «_» в таблице обозначен пробел. Например, чтобы набрать букву «a», надо нажать один раз на «1», букву «k» — два раза на «4», «!» — три раза на «0» и т.д.
Чтобы узнать, какой гонорар он должен получить за рекламную речёвку, которую в данный момент рассылает, Пете необходимо посчитать её стоимость по этому простому алгоритму.
А поскольку Петя очень занятой и вообще не умеет считать, так как учится на философском факультете, вы, как его самый лучший друг, готовы ему помочь.
Исходные данные
В единственной строке записана рекламная речёвка, состоящая из слов, пробелов, запятых, точек и восклицательных знаков. Все слова состоят из строчных английских букв.
В речёвке не более 1000 символов.
Результат
Выведите единственное число — стоимость речёвки в петином понимании.
 */

public class Task_1567 {

    public static void main(String[] args) throws IOException {
        BufferedReader consoleReader = new BufferedReader(new InputStreamReader(System.in));
        String line = consoleReader.readLine();
        consoleReader.close();
        int cost = 0;

        for (int i = 0; i < line.length(); i++)
            switch (line.charAt(i)) {
                case 'a':
                case 'd':
                case 'g':
                case 'j':
                case 'm':
                case 'p':
                case 's':
                case 'v':
                case 'y':
                case '.':
                case ' ':
                    cost += 1;
                    break;
                case 'b':
                case 'e':
                case 'h':
                case 'k':
                case 'n':
                case 'q':
                case 't':
                case 'w':
                case 'z':
                case ',':
                    cost += 2;
                    break;
                case 'c':
                case 'f':
                case 'i':
                case 'l':
                case 'o':
                case 'r':
                case 'u':
                case 'x':
                case '!':
                    cost += 3;
                    break;
                default:
                    break;
            }

        System.out.println(cost);
    }
}
